# GUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GUID Property
Alignment Class See Also
---
The GUID of this alignment.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public Guid GUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid GUID {
	Guid get ();
}
```

# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace